onethinx/Onethinx_Project_Examples/OnethinxCreator_ADC/Onethinx_Creator.cydsn/Generated_Source/PSoC6/ADC.h
/* Clock parameters*/
#if (ADC_CLOCK_INTERNAL)
    #define ADC_CFG0_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_CFG0_NOMINAL_CLOCK_FREQ)) - 1u)
#endif /* (ADC_CLOCK_INTERNAL) */

/* ************************************************************************** */
/* End configuration 0 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 1 customizer defines                                   */
/* ************************************************************************** */

#if(ADC_TOTAL_CONFIGS > 1)
    #define ADC_CFG1_SAMPLE_RATE             ()
    #define ADC_CFG1_CHANNEL_BASE            (u)
    #define ADC_CFG1_CHANNEL_COUNT           (u)
    #define ADC_CFG1_VREF_SEL_MASK           (u)
    #define ADC_CFG1_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_CFG1_CHANNEL_EN              (u)

    /* Sample Control Register */
    #define ADC_CFG1_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_CFG1_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_CFG1_SAMPLES_AVERAGED        (uL)
    #define ADC_CFG1_RANGE_INTR_MASK         (u)
    #define ADC_CFG1_SATURATE_INTR_MASK      (u)
    #define ADC_CFG1_VNEG_INPUT_SEL          ()
    #define ADC_CFG1_SINGLE_PRESENT          ()
    #define ADC_CFG1_VREF_MV_VALUE           ()
    #define ADC_CFG1_APERTURE_TIME0          (uL)
    #define ADC_CFG1_APERTURE_TIME1          (uL)
    #define ADC_CFG1_APERTURE_TIME2          (uL)
    #define ADC_CFG1_APERTURE_TIME3          (uL)
    #define ADC_CFG1_FREERUNNING             (u)
    #define ADC_CFG1_AVGERAGING_MODE         (uL)
    #define ADC_CFG1_LOW_LIMIT               (u)
    #define ADC_CFG1_HIGH_LIMIT              (u)
    #define ADC_CFG1_RANGE_COND              (uL)
    #define ADC_CFG1_USE_SOC                 (0uL)
    #define ADC_CFG1_VREF_PWR                (uL)
    #define ADC_CFG1_COMP_PWR                (uL)
    #define ADC_CFG1_COMP_DLY                (uL)

    /* Clock parameters*/
    #if (ADC_CLOCK_INTERNAL)
        #define ADC_CFG1_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_CFG1_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_CLOCK_INTERNAL) */
#endif /* #if(ADC_TOTAL_CONFIGS > 1) */

/* ************************************************************************** */
/* End configuration 1 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 2 customizer defines                                         */
/* ************************************************************************** */

#if(ADC_TOTAL_CONFIGS > 2)
    #define ADC_CFG2_SAMPLE_RATE             ()
    #define ADC_CFG2_CHANNEL_BASE            (u)
    #define ADC_CFG2_CHANNEL_COUNT           (u)
    #define ADC_CFG2_VREF_SEL_MASK           (u)
    #define ADC_CFG2_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_CFG2_CHANNEL_EN              (u)

    /* Sample Control Register */
    #define ADC_CFG2_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_CFG2_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_CFG2_SAMPLES_AVERAGED        (uL)
    #define ADC_CFG2_RANGE_INTR_MASK         (u)
    #define ADC_CFG2_SATURATE_INTR_MASK      (u)
    #define ADC_CFG2_VNEG_INPUT_SEL          ()
    #define ADC_CFG2_SINGLE_PRESENT          ()
    #define ADC_CFG2_VREF_MV_VALUE           ()
    #define ADC_CFG2_APERTURE_TIME0          (uL)
    #define ADC_CFG2_APERTURE_TIME1          (uL)
    #define ADC_CFG2_APERTURE_TIME2          (uL)
    #define ADC_CFG2_APERTURE_TIME3          (uL)
    #define ADC_CFG2_FREERUNNING             (u)
    #define ADC_CFG2_AVGERAGING_MODE         (uL)
    #define ADC_CFG2_LOW_LIMIT               (u)
    #define ADC_CFG2_HIGH_LIMIT              (u)
    #define ADC_CFG2_RANGE_COND              (uL)
    #define ADC_CFG2_USE_SOC                 (0uL)
    #define ADC_CFG2_VREF_PWR                (uL)
    #define ADC_CFG2_COMP_PWR                (uL)
    #define ADC_CFG2_COMP_DLY                (uL)

    /* Clock parameters*/
    #if (ADC_CLOCK_INTERNAL)
        #define ADC_CFG2_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_CFG2_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_CLOCK_INTERNAL) */
#endif /* (ADC_TOTAL_CONFIGS > 2) */


/* ************************************************************************** */
/* End configuration 2 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 3 customizer defines                                   */
/* ************************************************************************** */
#if(ADC_TOTAL_CONFIGS > 3)
    #define ADC_CFG3_SAMPLE_RATE             ()
    #define ADC_CFG3_CHANNEL_BASE            (u)
    #define ADC_CFG3_CHANNEL_COUNT           (u)
    #define ADC_CFG3_VREF_SEL_MASK           (u)
    #define ADC_CFG3_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_CFG3_CHANNEL_EN              (u)

    /* Sample Control Register */
    #define ADC_CFG3_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_CFG3_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_CFG3_SAMPLES_AVERAGED        (uL)
    #define ADC_CFG3_RANGE_INTR_MASK         (u)
    #define ADC_CFG3_SATURATE_INTR_MASK      (u)
    #define ADC_CFG3_VNEG_INPUT_SEL          ()
    #define ADC_CFG3_SINGLE_PRESENT          ()
    #define ADC_CFG3_VREF_MV_VALUE           ()
    #define ADC_CFG3_APERTURE_TIME0          (uL)
    #define ADC_CFG3_APERTURE_TIME1          (uL)
    #define ADC_CFG3_APERTURE_TIME2          (uL)
    #define ADC_CFG3_APERTURE_TIME3          (uL)
    #define ADC_CFG3_FREERUNNING             (u)
    #define ADC_CFG3_AVGERAGING_MODE         (uL)
    #define ADC_CFG3_LOW_LIMIT               (u)
    #define ADC_CFG3_HIGH_LIMIT              (u)
    #define ADC_CFG3_RANGE_COND              (uL)
    #define ADC_CFG3_USE_SOC                 (0uL)
    #define ADC_CFG3_VREF_PWR                (uL)
    #define ADC_CFG3_COMP_PWR                (uL)
    #define ADC_CFG3_COMP_DLY                (uL)

