onethinx/Onethinx_Project_Examples/OnethinxCreator_ADC/Onethinx_Creator.cydsn/Generated_Source/PSoC6/ADC.h
#endif /* ADC_TOTAL_CONFIGS > 3 */

/* ************************************************************************** */
/* End configuration 3 calculated defines                                     */
/* ************************************************************************** */

/******************************************************************************
* Function Name: ADC_Enable
****************************************************************************//*
*
* \brief Enables the component.
*
* \param None
*
* \return None
*
* \sideeffect
*  None
*
*******************************************************************************/
__STATIC_INLINE void ADC_Enable(void)
{
    Cy_SAR_Enable(ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the ADC_Stop() API to halt conversions. Instead use the
* ADC_StopConvert() API. If you use the ADC_Stop() API
* to halt conversions then later use the ADC_Start() and
* ADC_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The ADC_StopConvert() API will enable
* the ADC to complete the current scan of channels. After the
* channel scan is complete, the ADC will stop all conversions, which
* can be detected by the use of an ISR or the ADC_IsEndConversion()
* function.
*
*******************************************************************************/
__STATIC_INLINE void ADC_Stop(void)
{
    Cy_SAR_Disable(ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_StopConvert
****************************************************************************//**
*
* \brief Forces the ADC to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_StopConvert(void)
{
    Cy_SAR_StopConvert(ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The ADC channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int16_t ADC_GetResult16(uint32_t chan)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_allConfigs[ADC_currentConfig].numChannels);

    return Cy_SAR_GetResult16(ADC_SAR__HW, chan);
}

/*******************************************************************************
* Function Name: ADC_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The ADC channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t ADC_GetResult32(uint32_t chan)
{
    int32_t finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_allConfigs[ADC_currentConfig].numChannels);

    finalResult = Cy_SAR_GetResult32(ADC_SAR__HW, chan);

    return finalResult;
}

/*******************************************************************************
* Function Name: ADC_SetLowLimit
****************************************************************************//**
*
* \brief Sets the low limit parameter for a limit condition.
*
* \param lowLimit The low limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_SetLowLimit(uint32_t lowLimit)
{
    Cy_SAR_SetLowLimit(ADC_SAR__HW, lowLimit);
}

/*******************************************************************************
* Function Name: ADC_SetHighLimit
****************************************************************************//**
*
* \brief Sets the high limit parameter for a limit condition.
*
* \param highLimit The high limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_SetHighLimit(uint32_t highLimit)
{
    Cy_SAR_SetHighLimit(ADC_SAR__HW, highLimit);
}

/*******************************************************************************
* Function Name: ADC_SetLimitMask
****************************************************************************//**
*
* \brief Sets the channel limit condition mask.
*
*
* \param limitMask
* Sets which channels can cause a limit condition interrupt.
* Bit N of the mask enables the limit condition interrupt for channel N.
* The limitMask cannot be larger than the number of channels.
* If a channel is not enabled, it cannot cause any interrupts.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_SetLimitMask(uint32_t limitMask)
{
    Cy_SAR_SetRangeInterruptMask(ADC_SAR__HW, limitMask);
}

/*******************************************************************************
* Function Name: ADC_SetSatMask
****************************************************************************//**
*
* \brief Sets the channel saturation event mask.
*
* \param satMask
* Sets which channels can cause a saturation event interrupt.
* Bit N of the mask enables the saturation event interrupt for channel N.
* The satMask cannot be larger than the number of channels.
* If a channel is not enabled, it cannot cause any interrupts.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_SetSatMask(uint32_t satMask)
{
    Cy_SAR_SetSatInterruptMask(ADC_SAR__HW, satMask);
}

