onethinx/Onethinx_Project_Examples/OnethinxCreator_ADC/Onethinx_Creator.cydsn/Generated_Source/PSoC6/ADC.h
    return Cy_SAR_CountsTo_uVolts(ADC_SAR__HW, chan, adcCounts);
}

/*******************************************************************************
* Function Name: ADC_Sleep
****************************************************************************//**
*
* \brief This is the preferred routine to prepare the component for sleep. The
* ADC_Sleep() routine saves the current component state. Then it
* calls the ADC_Stop() function.
*
* Calling this routine directly is not needed.
* The ADC_DeepSleepCallbackStruct will ensure this routine
* is called before the device enters Deep Sleep mode.
*
* \param None
*
* \return None
*
* \sideeffect If this function is called twice in the enable state of the
* component, the disabled state of the component will be stored. So
* ADC_Enable() and ADC_StartConvert() must be called
* after ADC_Wakeup() in this case.
*
* \globalvars
*  \ref ADC_backup (W)
*
* \globalvars
*  \ref ADC_backup
*
*******************************************************************************/
__STATIC_INLINE void ADC_Sleep(void)
{
    Cy_SAR_Sleep(ADC_SAR__HW);
}


/*******************************************************************************
* Function Name: ADC_Wakeup
****************************************************************************//**
*
* \brief This is the preferred routine to restore the component to the state when
* ADC_Sleep() was called.
* If the component was enabled before the ADC_Sleep()
* function was called, the ADC_Wakeup() function also re-enables the
* component.
*
* Calling this routine directly is not needed.
* The ADC_DeepSleepCallbackStruct will ensure this routine
* is called after the device wakes up from Deep Sleep mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Calling this function without previously calling ADC_Sleep() may lead to
* unpredictable results.
*
* \globalvars
*  \ref ADC_backup (R)
*
* \globalvars
*  \ref ADC_backup
*
*******************************************************************************/
__STATIC_INLINE void ADC_Wakeup(void)
{
    Cy_SAR_Wakeup(ADC_SAR__HW);
}

#endif /* !defined(CY_ADC_H) */

/* [] END OF FILE */
